cc-payment-tracker-backend/app/models/credit_card.rb

    def update_balance(amount)
        new_balance = self.balance - amount.to_f
        self.update(balance: new_balance)
---
UPDATE "credit_cards" SET "balance" = ?, "updated_at" = ? WHERE "credit_cards"."id" = ?  [["balance", 7000.99], ["updated_at", "2020-01-29 20:25:54.594526"], ["id", 8]]