cc-payment-tracker-backend/app/controllers/api/v1/credit_cards_controller.rb

SELECT "credit_cards".* FROM "credit_cards"
---
    def index
        credit_cards = CreditCard.all

INSERT INTO "credit_cards" ("card_name", "last_four", "exp_date", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["card_name", "Amex Blue"], ["last_four", 9889], ["exp_date", "Jul 2020"], ["balance", 6789.0], ["created_at", "2020-01-23 00:43:31.739390"], ["updated_at", "2020-01-23 00:43:31.739390"]]
---
    def create
        credit_card = CreditCard.create(credit_card_params)