cc-payment-tracker-backend/app/controllers/api/v1/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
    def index
        transactions = Transaction.all

INSERT INTO "transactions" ("amount", "date", "credit_card_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 200.0], ["date", "2020-01-27"], ["credit_card_id", 1], ["created_at", "2020-01-27 22:28:03.180417"], ["updated_at", "2020-01-27 22:28:03.180417"]]
UPDATE "credit_cards" SET "balance" = ?, "updated_at" = ? WHERE "credit_cards"."id" = ?  [["balance", 7000.99], ["updated_at", "2020-01-29 20:25:54.594526"], ["id", 8]]
---
    def create
        transaction= Transaction.create(transaction_params)
        transaction.credit_card.update_balance(transaction_params[:amount])